app/views/users/index.html.erb

SELECT "credit_cards".* FROM "credit_cards" WHERE "credit_cards"."user_id" = ?  [["user_id", nil]]
---
    <% @users.each do |user| %>
      <% user.credit_cards.each do |credit_card| %>