app/controllers/credit_cards_controller.rb

SELECT "credit_cards".* FROM "credit_cards"
---
  def index
    @credit_cards = CreditCard.all

INSERT INTO "credit_cards" ("card_type_id", "number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["card_type_id", 1], ["number", 7893], ["created_at", "2020-05-31 07:08:33.099683"], ["updated_at", "2020-05-31 07:08:33.099683"]]
SELECT "credit_cards".* FROM "credit_cards"
---
  def create
    # binding.pry
    @credit_card = CreditCard.create_credit_card!(credit_card_params[:num])
    if @credit_card.errors.empty?

DELETE FROM "credit_cards" WHERE "credit_cards"."id" = ?  [["id", 1]]
SELECT  "credit_cards".* FROM "credit_cards" WHERE "credit_cards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    # binding.pry
    CreditCard.find(params[:id]).destroy