app/controllers/users_controller.rb

  def destroy
    binding.pry
    CreditCard.find(params[:id]).destroy
---
DELETE FROM "credit_cards" WHERE "credit_cards"."id" = ?  [["id", 2]]
SELECT "credit_cards".* FROM "credit_cards" WHERE "credit_cards"."user_id" = ?  [["user_id", 1]]