app/models/credit_card.rb

INSERT INTO "credit_cards" ("card_type", "number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["card_type", "Visa"], ["number", 7893], ["created_at", "2020-05-27 02:30:40.830547"], ["updated_at", "2020-05-27 02:30:40.830547"]]
INSERT INTO "card_types" ("name") VALUES (?)  [["name", "Visa"]]
INSERT INTO "credit_cards" ("card_type_id", "number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["card_type_id", 1], ["number", 7893], ["created_at", "2020-05-31 07:08:33.099683"], ["updated_at", "2020-05-31 07:08:33.099683"]]
SELECT "card_types"."name" FROM "card_types"
INSERT INTO "card_types" ("name") VALUES (?)  [["name", "MasterCard"]]
INSERT INTO "credit_cards" ("card_type_id", "number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["card_type_id", 5], ["number", 7893], ["created_at", "2020-05-31 07:51:07.000831"], ["updated_at", "2020-05-31 07:51:07.000831"]]
---
  def self.create_credit_card!(num)
    validator = CreditCardNumberValidator.new(num)
    card = CreditCard.new(number: num)
    card_type = CardType.new
    begin
      validator.validate!
      card_type.name = validator.type!
      card_type.save! unless CardType.pluck(:name).include?(card_type.name)
      # binding.pry
      card.card_type= card_type
      card.number = num[-4..-1].to_s
      # binding.pry
      card.save!