app/models/credit_card_number_validator.rb

SELECT "credit_cards".* FROM "credit_cards"
---
  def length_validate!
    raise 'Credit card number should contain only numbers' unless
    num.scan(/\D/).empty?
    raise 'Credit card number length should be between 13 and 16 digits' if
    num.length > 16 || num.length < 13

SELECT "credit_cards".* FROM "credit_cards"
---
  def master?
    num.length == 16 && num[0] == '5' && (1..5).map(&:to_s).include?(num[1]) ? 'MasterCard' : nil

SELECT "credit_cards".* FROM "credit_cards"
---
  def discover?
    num.length == 16 && num[0..3] == '6011' ? 'Discover' : nil

SELECT "credit_cards"."number" FROM "credit_cards"
---
  def unique?
    # binding.pry
    unique = !CreditCard.pluck(:number).include?(num[-4..-1])